<template>
    <div class="fixed-box">
        <svg class="icon" @click="closed(is_Elastic = false)">
            <use xlink:href="#icon-address-del"></use>
        </svg>
        <h2>创联入驻协议</h2>
        <img src="../../images/xieyi.png">
        <div class="edit">
            <p>
                本协议是由 “杭州创联集采数字科技有限公司”（以下简称“甲方”）与拥有 GMP或者GSP、医疗器械生产许可/备案或者医疗器械经营许可
                /备案资质的药品、 医疗器械、大健康等商品生产、批发、销售业务公司（以下简称“您”或“乙方”或“商家”）共同签署，本公司
                依托“创联工厂”平台向商家提供平台服务 所订立的契约。您通过网络页面点击确认，即表示您同意接受本协议的全部约定内容以及与
                本协议有关的已经发布或将来可能发布的各项规则、页面展示、操 作流程、公告或通知（以下统称“规则”）。在接受本协议之前， 请
                您仔细阅读本协议的全部内容（特别是以粗体标注的内容）。如果您不同意本 协议的任意内容，或者无法准确理解该条款的含义
                ，请不要进行任何操作。
            </p>
            <h3>一、定义</h3>
            <p>
                1、甲方平台：指运行于域名为 的“创联工厂”平台，是商家可通过“创联工厂”平台设立店铺进行推广经营并达成交易意向的特
                定网络空间。<br>
                2、甲方平台服务：指基于互联网和“创联工厂”平台网站、客户端等在内的各种服务形态所提供的各项服务。<br>
                3、GMP:是指药品生产质量管理规范，是一套适用于制药、食品行业的强制性标准，要求企业从原料、人员、设施设备、生产过程、
                包装运输、质量控制等方面按国家有关法规达到卫生质量要求。<br>
                4、GSP:是指药品经营质量管理规范，是在药品流通过程中，针对计划采购、购进验收、储存、销售及售后服务等环节而制定的保
                证药品符合质量标准的一项管理制度。<br>
                5、店铺：是指在“创联工厂”平台向甲方申请，经甲方审核通过的具有独立且唯一性身份标识号码、特定名称的网络
                化虚拟商铺。店铺形式包括品牌商城或中医特色疗法医馆等。<br>
                6、商家：是指拟在“创联工厂”平台以独立第三方经营者身份开设推广店铺，从事经营的法律实体，必须自申请时起持续具备本协议第三条约定的资质要求。
                7、第三方支付银行：是指为平台商家提供支付结算服务的银行。
            </p>
            <h3>二、服务内容</h3>
            <p>1、甲方向乙方提供甲方平台上相应的网络空间、技术支持和系统维护，以及甲方平台的服务和各项附属功能、增值服务等，支持乙方基于甲方平台
                投放互联网广告（包括但不限分区首页、品牌专区、推荐位、招商位等广告位）。<br>
                2、甲方通过甲方平台可为乙方提供的服务内容包括：品牌商城与基础服务、市场管控与拓展服务、市场营销与增效服务、流向信息与数据服务、
                平台引流与宣传服务。具体的服务项目和收费标准由甲乙双方另行协商并签署补充协议约定。
            </p>
            <h3>三、资质要求及证明文件</h3>
            <p>
                1、资质要求<br>
                乙方申请及开展店铺经营活动，须持续的同时满足以下基本条件：<br>
                （1）乙方已依照中华人民共和国法律法规注册并领取合法有效的营业执照及取得其他经营许可或者备案凭证；<br>
                （2）乙方经营的商品来源合法，资质齐全，不侵犯第三方合法权益；<br>
                （3）乙方提交的任何信息均真实、合法、有效，所使用的图片、文字等不侵犯任何第三方合法权益。
            </p>
            <p>
                2、证明文件<br>
                （1）乙方应根据所经营内容选择向甲方提交以下文件或证明，包括但不限于营业执照、税务登记证、药品经营许可证、药品经营质量管理
                规范认证证书、药品生产许可证、药品生产质量管理规范认证证书、医疗器械生产许可证或者备案凭证、医疗器械经营许可证或者备案凭证、
                医疗器械注册证或者备案凭证、食品经营许可证、授权委托书、商标注册证、药检报告单、报关单、检验检疫证书、商品来源地证明、
                法定代表人身份证正反面复印件等。<br>
                （2）乙方保证向甲方提供的上述证明文件或其他相关证明真实、合法、准确、有效，甲方有权自行或单方聘请第三方公司予以核实。<br>
                （3）乙方保证上述证明文件发生任何变更或更新时立即通知甲方，并于十五个工作日内，提交更新后的文件。<br>
                （4）乙方提交虚假、过期文件或未如期通知并提交更新文件等情形的，由乙方独立承担全部法律责任。
            </p>
            <h3>四、甲方的权利和义务</h3>
            <p>
                1、甲方在现有技术实现基础上努力维护甲方平台的正常稳定运行，并努力提升和改进技术，对平台功能及服务进行更新、升级，以不断提升平
                台性能和交易效率。如发现乙方有损系统安全、稳定操作的，甲方有权立即停止乙方的服务权限，并立即删除所有有害信息、数据等；乙方应
                对此导致的一切不利后果承担全部法律责任。<br>
                2、甲方有权对乙方提供的企业资质证照（包括但不限于营业执照、药品/医疗器械/保健食品生产许可证、药品/医疗器械/保健食品经营许可证等
                ）、商品基本信息、服务规范承诺等资质证照和信息资料进行审核。<br>
                3、甲方有权单方根据国家相关法律法规、政策及甲方平台运营情况，对公示于甲方平台的规则进行变更，变更后的规则将以公告形式告知乙方，
                任何变更一经公告即构成本协议的组成部分。乙方应实时关注公告内容，如不同意该变更，应书面通知甲方并立即停止使用甲方平台服务，一旦乙
                方继续使用甲方平台服务，则视为乙方自愿接受变更后的规则。<br>
                4、甲方有权根据市场情况及乙方在甲方平台内的经营情况组织相应的促销活动，乙方应根据自身经营情况及商品情况予以积极支持并按约履行。
                一旦乙方以书面方式（包括但不限于电子邮件、传真等）确认选择参与上述促销活动的，不得中途退出。<br>
                5、甲方有权为乙方提供本协议所约定服务、商品渠道建设和线上促销等方案的设计与实施、市场推广与咨询。<br>
                6、甲方有权对乙方所提供的商品信息、服务信息进行编辑和美化处理。<br>
                7、甲方应当根据本协议约定通过甲方平台为乙方所属企业提供品牌商城的建设、招商与业务运营服务，包括但不限平台广告、搜索优化以及活
                动信息推送、精准客户推荐等。<br>
                8、甲方负责整合甲乙双方确定的已上线合作客户的转化活动（线下活动转线上）的策划，并提供必要的平台资源与流量支持，以促进活动效果。<br>
                9、甲方应当采取技术措施和其他必要措施保证其网络安全、稳定运行，防范网络违法犯罪活动，有效应对网络安全事件，保障交易安全。<br>
                10、甲方应当记录、保存平台上发布的商品和服务信息、交易信息，并确保信息的完整性、保密性、可用性、可追溯。商品和服务信息、交易信息
                保存时间自交易完成之日起不少于三年。医疗器械交易信息记录应当保存至医疗器械有效期后2年；无有效期的，保存时间不少于5年；植入类医
                疗器械交易信息应当永久保存。<br>
                11、若甲方发现乙方的运营情况不能满足甲方平台公布的要求（包括但不限于甲方平台规则等），经限期整改调整后，仍无法满足的，甲方有权
                解除本协议，停止向乙方提供服务。<br>
                12、若甲方发现乙方有违反法律、法规、规章或监管等规定的行为，甲方有权要求乙方予以整改、并执行监管意见；乙方怠于执行或迟延执行的，
                甲方有权采取相关措施或终止提供平台服务，并向甲方所在地工商行政管理部门或市场监督管理部门报告，由此产生的不利后果由乙方自行承担。<br>
            </p>
            <h3>五、乙方的权利和义务</h3>
            <p>
                1、乙方应当按本协议第三条的要求提供企业资质、商品信息、商品图片以及其它相关信息内容，并保障上述信息内容的真实性和合法性，发生变更
                时应及时通知甲方。若乙方提交虚假、过期文件或未如期通知并提交更新文件等情形的，由乙方独立承担全部法律责任，且乙方应按照甲方的要
                求补充提供相关资料。如乙方造成甲方及其他任何第三方损失的，应足额赔偿。<br>
                2、乙方有权参加甲方平台开展的相关活动，并享有甲方届时提供的优惠政策。<br>
                3、乙方合作客户有权定期享受甲方平台专区采购的支付优惠政策。<br>
                4、乙方应当确保其委托甲方平台进行的推广项目所对应的销售及配套政策优于线下相关政策，以保证终端客户线上采购体验与效果。<br>
                5、乙方应当向其合作的商业、终端药房、诊所等主体推荐甲方平台以及甲方平台活动，辅导客户应用甲方平台参与促销与日常采购。<br>
                6、乙方承诺并保证，甲方平台上现在以及本协议有效期间所不时公布的规则、声明、交易流程均对乙方具有约束力，将自动适用于乙方，乙方应当
                予以遵守。若乙方不接受修改内容，有权终止本协议，但应提前7个工作日书面通知甲方。<br>
                7、乙方应对店铺负有管理义务，对其店铺中出现的违反国家有关法律、法规规定及甲方平台规则的信息予以立即删除。<br>
                8、乙方应对其在甲方平台销售的每款商品按照国家标准，行业标准进行质量控制（包括且不限于商品法律法规符合性，商品安全性，
                商品功能材质与描述符合性，商品标识标示，商品外观，商品包装等），并依照国家法律法规提供售后服务。<br>
                9、乙方应保证拥有在甲方平台经营商品的合法销售权，商品来源可溯、合法、质量合格，符合国家相关质量标准，不侵犯任何第三方
                的合法权利，并对其商品质量及商品合法性独立承担全部法律责任。<br>
                10、乙方应保证履行“如实描述”义务，保证在甲方平台发布的商品信息真实、准确，符合甲方平台规则及国家相关法律法规的规定，与实际出售的商品一致，不含
                任何夸大或虚假内容，不包含任何未经授权的文字和图片，对描述的准确和相符负有举证责任并承担独立的完全的法律责任。若发布的上述信息变更的，
                乙方应及时予以更新。若因信息未及时变更引起法律后果的，乙方应独立承担全部责任。<br>
                11、乙方应保证从甲方平台获取的任何数据不会用于本协议约定以外的用途，同时保证未经甲方许可不得擅自获取、使用、传播甲方平台的任何资料。<br>
                12、乙方不得隐瞒任何可能对甲方平台产生风险的事项，包括但不限于商品出现设计缺陷及质量瑕疵、权利纠纷、重大违约、上传资料包含
                病毒木马等。<br>
                13、如因乙方商品、发布的信息或提供的售后服务问题而引发客户对甲方的诉讼，乙方应承担因诉讼而产生的全部法律责任，如因此而给甲方造成损失的，
                甲方有权要求乙方赔偿全部损失。<br>
                14、乙方同意，乙方因开设店铺及其经营需要、履行本协议义务而向甲方提交的任何信息和数据，以及乙方在经营过程中产生的数
                据，包括但不限于交易数据、店铺以及商品评价数据、浏览行为以及其他交互行为数据等，甲方有权在本协议终止后继续
                保留，同时，无论本协议终止前还是终止之后，甲方均有权合理使用，使用方式包括但不限于进行大数据分析应用和市场
                调研、产品化服务或向金融机构及有关主管部门提供。<br>
            </p>
            <h3>六、费用及结算</h3>
            <p>
                1、服务费<br>
                乙方同意按甲乙双方协商确定的标准通过补充协议的形式向甲方支付服务费。<br>
                （1）针对本协议项下按单笔订单金额收的服务费用，乙方应当自本协议生效后可提前预付创联工厂云宽带使用服务费。<br>
                （2）针对本协议项下其他收费方式的服务费用，在乙方创联工厂云宽带使用服务费充足的情况下自动扣除。<br>
            </p>
            <p>
                2、交易款结算<br>
                （1）乙方同意，甲方将引入第三方支付银行为甲方进行支付和结算。乙方应按要求与第三方支付银行签署可能存在的相关协议。<br>
                （2）由于各第三方支付银行的到账时间不同，乙方实际收到款项的时间以第三方支付银行所不时公布的具体到账时间为准，如遇节假日时间顺延。<br>
                （3）乙方应向甲方提供指定的银行开通结算账户。如果乙方指定收款账户发生变更的，应当至少提前5个工作日通知甲方，否则因此发生的未能
                成功接收甲方平台第三方支付银行和/或甲方的结算款项的责任和损失由乙方自行承担。乙方所指定的收款账户应当是在其自身名下的银行账户。<br>
                （4）甲方与乙方根据本协议开展的业务以人民币作为结算货币。<br>
            </p>
            <h3>七、保密条款</h3>
            <p>
                1、对于甲方向乙方提交的线上活动的设计、创意及策划等资料（“特定保密信息”），未经甲方事先书面同意，乙方不得向任何第三方
                (除乙方的授权代表外)披露上述资料、以及双方在有关设计、创意、策划、执行服务中的工作内容以及本协议和其它相关往来文件
                的内容，本款项下的保密义务自甲方向乙方披露相关资料之日起，至甲方或其授权第三方主动披露上述资料及信息之日止。<br>
                2、双方应当对在履行本协议过程中知悉的对方的商业秘密，包括技术信息、经营信息以及本协议和其他相关往来文件等内容，负有保
                密义务，未经对方书面事先同意，不得向任何第三方（除该方的授权代表外）披露。任何一方可仅为本协议目的向其确有知悉必要
                的雇员披露对方的商业秘密，但同时须指示其雇员遵守本条规定的保密及不披露义务。任何一方应仅为本协议目的而复制和使用对方的
                商业秘密。但因司法程序的原因公开、政府机构要求公开的除外。本款项下的保密义务自本协议生效之日起至本协议终止之日后一年止。<br>
                3、本协议无论由于何原因终止或解除，均不影响甲乙双方继续承担本协议项下的保密义务。<br>
                4、如任何一方违反上述保密义务，另一方有权终止解除本协议，并要求违约方承担赔偿责任。<br>
            </p>
            <h3>八、不可抗力及除外责任</h3>
            <p>
                1、因不可抗力（包括自然灾害、战争、政府行为、罢工等不能预见、不能避免和不能克服的客观情况等）致使一方无法履行或无法全部履行
                本协议的，双方可根据实际情况协商决定部分履行、延期履行或终止本协议，部分或全部免除违约责任。<br>
                2、因互联网灾难、黑客攻击以及互联网通讯提供商原因导致任意一方服务器不能正常运行或电力系统故障，不视为违约行为，双方应
                尽商业上的合理努力争取尽快恢复正常服务。<br>
                3、受不可抗力影响的一方应及时通知对方，并在不可抗力事件发生后五个工作日内将不能履行本协议的原因书面通知对方，并提供有关证明文件。<br>
            </p>
            <h3>九、诚信经营</h3>
            <p>
                乙方应保证在使用甲方平台进行交易的过程中遵守诚实信用原则，禁止超范围经营，禁止销售伪劣商品、过有效期商品以及未经国家相关机关和机构批准认证的商品，
                不得在交易中采取欺诈及虚假宣传、混淆等不正当竞争行为，不得扰乱网上交易的正常秩序，不得从事与网上交易无关的行为。
            </p>
            <h3>十、知识产权</h3>
            <p>
                1、本协议一方提供给另一方使用的技术参数、报告及与系统运行相关的数据均为一方所有并享有相应的权利，另一方未经许
                可不得用于本协议约定项目以外的用途。<br>
                2、属于一方的标识、商标及企业名称、代言人形象等为一方的知识产权，另一方未经许可不得使用。本协议终止后，
                一方不得以任何目的使用另一方的商标、标识、代言人形象、数据接口、系统等知识产权。<br>
                3、若知识产权权利人认为其知识产权受到侵害通知甲方的，甲方有权在收到权利人通知并经核实无误后立即采取删除、屏蔽、
                断开链接、终止交易和服务等必要措施。<br>
            </p>
            <h3>十一、违约和终止</h3>
            <p>
                1、一方违反其在本协议项下的任何义务和责任，另一方有权要求违约方限期改正，如违约方在十五日内未能改正的，守约方有权
                以书面通知形式通知对方解除本协议，并有权要求违约方赔偿守约方所有经济损失。<br>
                2、如果乙方未能按本协议约定时间按时足额向甲方指定银行账户支付费用，乙方应当按照应付未付款项的万分之五每日的标准向甲方
                支付滞纳金；如果逾期十五日乙方未能足额支付所有费用，甲方有权终止和解除本协议，并且甲方有权终止和乙方的一切合作，乙方应当
                向甲方支付本协议服务项目总费用的20%作为违约金，如给甲方造成超过前述违约金的其他损失、损害，乙方仍旧应当向甲方赔偿和承担。<br>
                3、如果乙方提供的资质证照或信息资料不属实，甲方有权拒绝向乙方提供本协议项下的任何服务并有权终止本协议。如果情节严重的，
                甲方有权要求乙方赔偿和承担甲方因此遭受的任何损失、损害，并有权通过相关主管部门追究乙方的其他法律责任。<br>
                4、乙方承诺不在甲方平台销售假冒伪劣商品、禁售商品、不合格商品等，否则甲方有权要求乙方承担相应法律责任。同时甲方有权对乙方
                采取暂停提供服务、暂时关闭后台管理账户、暂缓支付未结算款项、终止合作等措施。违约金不足以弥补甲方损失的，乙方还应全部赔偿。<br>
                5、如乙方在甲方平台上发布的信息涉嫌违法、侵犯他人合法权利或违反本协议或甲方平台的相关规则的，甲方有权不经乙方同意删除相关信
                息，并要求乙方赔偿甲方因此而产生的全部损失（包括直接损失和间接损失），此外，甲方有权单方决定以书面通知乙方终止本协议。<br>
                6、一方因其法人主体资格被撤销、注销或破产重组，或其在本协议项下的资质证照失效或被依法取缔的，另一方有权以书面形式通
                知终止解除本协议。<br>
                7、因不可抗力因素造成本次合作无法继续开展，或合作目的无法达成的，任何一方均有权提前十五日以书面形式通知
                解除本协议，对此双方互不承担违约责任。<br>
                8、本条中涉及的违约金及赔偿金，乙方应在5日内支付，否则甲方有权暂缓支付未结算款项并直接自暂缓支付
                的未结算款项中扣除相关款项。<br>
            </p>
            <h3>十二、法律适用及争议解决</h3>
            <p>本协议的形成、效力、解释、签署、修改、履行及终止均受中国大陆地区法律管辖。因履行本协议或与本协议有关的一切争议，
                双方当事人应通过友好协商解决；如果协商未成，则该争议事项应提交至北京市朝阳区人民法院诉讼解决。</p>
            <h3>十三、通知及送达</h3>
            <p>
            1、除法律法规或监管规定另有强制性规定外，本合同履行过程中，任一方向另一方发送书面通知的，按照本协议约定的地址交邮后的第7个自然日即视为送达；书面通知的形式包括但
            不限于在甲方平台发布公告、发送电子邮件、联系人手机短信和传真等电子方式，在采用电子方式进行书面通知的情况下发送当日即视为送达。甲乙双方
            应保证提供的联系地址、联系人、联系电话真实、准确、有效，如信息变更应立即通知对方，若对方未及时通知的，向原地址送达的仍视为有效送达地址。<br>
            2、对于因合同争议引起的任何纠纷，任一方声明法院或仲裁机构可以手机短信或电子邮件等现代通讯方式或邮寄方式向乙方送达法律文书（包括诉讼文书）。
            法院向前述地址发出法律文书即视为送达，发送当日即为送达之日。<br>
            3、甲乙双方应保证提供的地址准确无误，如果提供的送达地址不确切，或不及时告知变更后的地址，或拒绝签收等原因，导致法律文书未能被乙方
            实际接收的，邮寄送达的，以文书退回之日视为送达之日；直接送达的，送达人当场在送达回证上记明情况之日视为送达之日；履行送达地址变更
            通知义务的，以变更后的送达地址为有效送达地址。
            </p>
            <h3>十四、其他</h3>
            <p>
                1、本协议有效期1年，自乙方通过网络页面点击确认之日起生效。<br>
                2、本协议未尽事宜或待修改事项，应由甲乙双方共同协商并签署书面补充协议。<br>
                3、本协议旨在确定双方合作的主要意向，若本协议签署后双方经协商一致同意进行具体合作的，应签署具体的项目协议，对有关具体合作的方式、合作期限、
                合作费用承担等内容进行约定。<br>
                4、乙方同意，甲方有权随时对本协议内容进行单方面的变更，并以网站公告形式通知乙方，该等变更将在公告载明的生效时间生效；如
                果乙方不同意对本协议相关条款所做的修改，应立即停止使用甲方提供的本项服务。如果乙方继续使用甲方提供的服务，则视为接受并认可本协议
                相关条款的修改。<br>
            </p>
        </div>
        <div class="btn">
            <p @click="agree(isAgree = true,is_Elastic=false)">同意协议</p>
            <p @click="notAgree(isAgree = false,is_Elastic=false)">我再想想</p>
        </div>
    </div>
</template>

<script>
    export default {
        name: "RegisterProtocol",
        props: ["closed", "notAgree","agree"]
    }
</script>

<style lang="scss" scoped>
    .fixed-box {
        background: #fff;
        position: fixed;
        width: 6.90rem;
        height: 11rem;
        left: 50%;
        margin-left: -3.45rem;
        top: 50%;
        margin-top: -5.5rem;
        z-index: 100;
        text-align: center;

        .icon {
            width: .32rem;
            height: .32rem;
            position: relative;
            float: right;
            margin-top: .2rem;
            margin-right: .2rem;
        }

        h2 {
            text-align: center;
            font-size: .44rem;
            padding-top: .7rem;
        }

        img {
            width: 2.5rem;
            margin-top: .3rem;
        }

        .edit {
            font-size: .28rem;
            padding: .5rem;
            letter-spacing: 1px;
            line-height: 1.5;
            height: 6rem;
            margin-bottom: .6rem;
            overflow-y: scroll;
            overflow-x: hidden;
            text-align: left;

            h3 {
                font-size: .32rem;
            }

            p {
                text-indent: 2em;
            }
        }

        .btn {
            p {
                width: 5.78rem;
                height: .9rem;
                background: rgba(0, 144, 255, 1);
                border-radius: .45rem;
                color: #fff;
                font-size: .36rem;
                line-height: .9rem;
                margin: .2rem auto;

                &:nth-child(2) {
                    background: #fff;
                    color: rgba(0, 144, 255, 1);
                }
            }
        }
    }
</style>