<template>
    <div style="background: #fff">
        <clxsd-head-top title='服务条款'></clxsd-head-top>
        <h2 class="p1">服务条款</h2>
        <div class="edit">
            <div>
                一、概述<br/>
                <p>
                    河南康达医药科技有限公司服务条款（下称“服务条款”）是河南康达医药科技有限公司 (下称“康达医药”或“康达医药公司”)与用户
                    （下称“用户”或“您”）就康达医药服务等相关事项所订立的有效合约。<br/>
                    康达医药公司为更好地保障您及自身的合法权益，本着公开、公平、公正的原则，根据相关法律法规规定，制定本服务条款。<br/>
                    您通过电子签章、盖章、网络页面点击确认或以其他方式选择接受本服务条款，即表示您与康达医药公司已达成协议并同意接受本服务条款的全部约定内容。
                    本服务条款将适用于康达医药公司和所有享受康达医药服务的用户。<br/>
                    您应遵守国家法律、行政法规、部门规章等规范性文件。对任何涉嫌违反国家法律、行政法规、部门规章等规范性文件的行为，本服务条款已有规定的，适用
                    本服务协议；本服务协议尚无规定的，康达医药公司有权酌情处理。但康达医药公司对您的处理不免除其应尽的法律责任。<br/>
                    康达医药公司有权在必要时变更本服务条款并在网站和App上予以公告。若您不同意相关变更，可放弃使用康达医药服务的权利。康达医药公司有权对您的行为
                    及应适用的规则进行单方认定，并据此认定处理。<br/>
                    在接受本服务条款之前，请您仔细阅读本服务条款的全部内容。如果您对本服务条款的条款有疑问的，请您联系康达医药公司，康达医药公司将向您解释条款
                    内容。如果您不同意本服务条款的任意内容，或者无法准确理解康达医药公司对条款的解释，请不要进行后续操作。
                </p>
            </div>
            <div>
                二、服务内容<br/>
                <p>
                    1、本服务条款中“服务”特指康达医药服务。</p>
                    <p>2、康达医药公司提供的康达医药服务必须符合本服务条款的约定。</p>
            </div>
            <div>
                三、付费及续费<br/>
                <p>
                    1、康达医药公司可能会向您提供一定期限内的免费体验服务。若您需要使用康达医药服务，请您对您所需的康达医药服务进行付费。具体付费事项
                    请您参见康达医药公司提供的服务收费标准或咨询康达医药公司。如您与康达医药公司有对服务内容、服务权限、服务期限及付费金额等事项
                    签署付费服务协议进行约定，请按双方相关约定进行付费。若您不付费，康达医药公司有权停止您享受的相应康达医药服务。<br/>
                <p>
                    2、服务期满若您愿意继续享受相关服务，您应提前向康达医药公司支付续费款项，以使服务得以继续进行。如续费时康达医药公司对康达医药服务
                    体系、名称或价格进行调整的，双方同意按照届时有效的新的服务体系、名称或价格履行，但调整前您已经支付的款项不受影响。<br/>
                <p>
                    3、康达医药公司保留在您未按照约定支付全部费用之前不向您提供服务或者终止服务的权利。
                </p>
            </div>
            <div>
                四、您的权力与义务<br/>
                <p>
                    1、您成功付费后，您有权拥有享受相应康达医药服务的账号，您有权凭账号和密码享受康达医药公司向您提供的服务。并有权利在享受康达医药
                    服务时获得康达医药公司相对应的技术支持、咨询等，具体服务内容详见您与康达医药公司签署付费服务协议的相关内容。<br/>
                    2、您的账号和密码仅限您本人使用，您对自己使用康达医药服务过程产生的数据以及进入和管理康达医药服务上各类产品与服务的账号、密码的完
                    整性和保密性负责。因您维护不当或保密不当致使上述数据、口令、密码等丢失或泄漏所引起的一切损失和后果均由您自行承担。若您的账号和密码
                    擅自转让或者授权他人使用，因此造成的一切后果应由您本人承担。您有权根据康达医药公司规定的程序修改密码。<br/>
                    3、您若发现任何非法使用您账号或存在安全漏洞的情况，请您立即通告康达医药公司。<br/>
                    4、您同意遵守本服务条款以及服务展示页面的相关管理规范及流程。您了解上述服务条款的内容可能会不时变更。如本服务条款的任何内容发
                    生变动，康达医药公司应提前在网站及App的适当版面公告向您提示修改内容。如您不同意康达医药公司对服务条款相关条款所做的修改，您有
                    权停止使用康达医药服务，此等情况下，康达医药公司应与您进行服务费结算（如有），并且您需要自行备份数据。如您继续使用康达医药服务，
                    则视为您接受康达医药公司对服务条款相关条款所做的修改。<br/>
                    5、您应按照康达医药公司在网站及App公示的提示及本服务条款的约定支付相应服务费用，或者按您与康达医药公司对服务内容、服务权限、服
                    务期限及付费金额等事项签署的付费服务协议中的约定支付相应服务费用。<br/>
                    6、您承诺：<br/>
                    （1）您承诺并保证您是具有完全民事行为能力和完全民事权利能力的自然人、法人、实体或组织。您承诺并保证您所填写的您的相关信息是真实、
                    准确、完整、及时的，您承诺将及时更新您的信息以维持该等信息的有效性。您承诺并保证您提交的资料或信息没有任何引人误解或者虚假的陈述，
                    且保证康达医药公司可以通过您所填写的联系方式与您取得联系。您承诺您应根据康达医药公司对于相关服务的要求及时提供相应的身份证明、资质
                    信息等资料，否则康达医药公司有权拒绝向您提供相关服务。您承诺如果您提供的资料或信息包含有不正确、不真实的信息，康达医药公司保留取消
                    您享受相应服务的资格并随时结束为您提供服务的权利。<br/>
                    （2）您承诺以代理人身份代理其他自然人、法人、实体或组织使用康达医药服务时，您必须向康达医药公司提供代理人和被代理人的详细资料和信
                    息及授权书面文件。<br/>
                    （3）您承诺如果您使用康达医药服务进行的经营活动需要获得国家有关部门的许可或批准的，应获得该有关的许可或批准。例如您从事新闻、出版、
                    教育、医疗保健、药品和医疗器械等，同时您理解并认可，以上列举并不能穷尽您进行经营活动需要获得国家有关部门的许可或批准的全部类型，您
                    应获得有关的许可或批准，并应符合国家及地方不时颁布相关法律法规之要求；<br/>
                    （4）您承诺若康达医药公司的服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束；<br/>
                    （5）您承诺并保证您使用康达医药服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，您承诺并保证不利用康达医药服务提供的资源和
                    服务上传、下载、储存、发布、传播如下信息或者内容，不为他人发布该等信息提供任何便利：①违反国家规定的政治宣传或新闻信息；②涉及国
                    家秘密和安全的信息；③封建迷信和淫秽、色情、下流的信息或教唆犯罪的信息；④博彩有奖、赌博游戏、“私服”、“外挂”等非法互联
                    网出版活动；⑤违反国家民族和宗教政策的信息；⑥妨碍互联网运行安全的信息；⑦侵害他人合法权益的信息和其他有损于社会秩序、社会治安
                    、公共道德的信息或内容；⑧其他违反法律法规、部门规章或国家政策的任何内容信息。 您承诺并保证不为他人发布上述不符合国家规定和本服务条
                    款约定的信息内容提供任何便利，包括但不限于设置URL、 BANNER链接等。您承认康达医药公司有权在您违反上述时有权终止向您提供服务并不于
                    退还任何款项，因您上述行为给康达医药公司造成损失的，您应予赔偿。<br/>
                    （6）您承诺并保证不进行任何破坏或试图破坏网络安全的行为（包括但不限于钓鱼，黑客，网络诈骗，网站或空间中含有或涉嫌散播：病毒、木
                    马、恶意代码，及通过虚拟服务器对其他网站、服务器进行涉嫌攻击行为如扫描、嗅探、ARP欺骗、DOS等）；<br/>
                    （7）您承诺并保证不会利用技术或其他手段破坏及扰乱康达医药公司以及康达医药公司其他用户的系统、网站及App。
                    （8）您承诺并保证尊重康达医药公司及其他第三方的知识产权和其他合法权利，并保证在发生上述事件时尽力保护康达医药公司及其股东、雇员、合
                    作伙伴等免于因该等事件受到影响或损失；康达医药公司保留您侵犯康达医药公司之知识产权时终止向您提供服务并不退还任何款项的权利。<br/>
                    （9）您承诺对由于您给康达医药公司提供的联络方式有误以及您用于接受康达医药公司邮件的电子邮箱安全性、稳定性不佳而导致的一切后果，您
                    应自行承担责任，包括但不限于因您未能及时收到康达医药公司的相关通知而导致的后果和损失。<br/>
                    （10）您承诺并保证不从事其他违法、违规或违反康达医药服务条款的行为。您承诺使用康达医药服务时所引起的一切法律纠纷均与康达医药公司无关。
                </p>
            </div>
            <div>
                五、康达医药公司的权利和义务<br/>
                <p>
                    1、康达医药公司有权利对您进行审查并决定是否接受您成为康达医药公司会员或是否向您提供服务。
                </p>
                <p>
                    2、康达医药公司应按照服务条款约定和根据您选择的服务以及交纳款项的情况向您提供相应服务,保证服务可持续运行及数据安全。</p>
                <p>
                    3、康达医药公司有权在您使用康达医药服务期内在服务器上保存您的数据信息。</p>
                <p>
                    4、康达医药公司有权随时删除含有任何危害国家安全、淫秽色情、虚假、侮辱、诽谤、恐吓或骚扰、侵犯他人知识产权、版权或人身权或其他合法权益
                    等违法或有违社会公序良俗的内容。</p>
                <p>
                    5、康达医药公司保留为维护系统升级而短暂停止服务的权利，在暂停服务之前，康达医药公司将通过网站及App予以公告。</p>
                <p>
                    6、康达医药公司可以根据中国法律法规的调整、行政执法机关的命令和社会伦理道德的变化相应调整康达医药服务的审核标准，您不得以
                    类似“以前曾通过康达医药公司审核”的理由要求康达医药公司继续审核通过。</p>
                <p>
                    7、在服务期限内，康达医药公司还将为您提供如下服务：</p>
                <p>
                    （1）康达医药公司为付费的您提供售后故障服务，并为付费的您提供有效的联系方式并保证付费您能够联系到故障联系人。故障联系人在
                    明确故障后及时进行反馈；</p>
                <p>
                    （2）康达医药公司提供在线客服服务系统，解答您在使用中的问题。</p>
                <p>
                    8、康达医药公司承诺严格遵守数据保密义务。康达医药公司承诺对您的资料信息采取对外保密措施，不向第三方披露您的资料信息，除非：</p>
                <p>
                    （1）依据本服务条款或者您与康达医药公司之间其他服务协议、服务条款、在线条款等规定可以提供的；</p>
                <p>
                    （2）依据法律法规的规定应当提供的；</p>
                <p>
                    （3）行政、司法等有权部门要求康达医药公司提供的；</p>
                <p>
                    （4）经您同意或授权康达医药公司向第三方提供的；</p>
                <p>
                    （5）康达医药公司为解决举报事件、提起诉讼等而提供的；</p>
                <p>
                    （6）康达医药公司为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提供的</p>
                <p>
                    （7）康达医药公司为向您提供产品、服务、信息而向第三方提供的，包括康达医药公司通过第三方的技术及服务向您提供产品、服务、信息的情况。<br/>
                    9、康达医药公司保留在您违反国家、地方法律法规规定的情况下，或康达医药公司发现您违反本服务条款规定的任何条款的约定时，康达医药公司有权拒
                    绝向您提供康达医药服务的权利，包括但不限于立即终止服务、中止服务或删除相应信息等。您已支付的“服务费”不予退还，同时康达医药公司有进一
                    步追究您法律责任的权利。并且在任何情况下，康达医药公司对任何间接、偶然、特殊及继起的损害不负责任。如果第三方机构或个人对您提出质疑或投
                    诉，康达医药公司将通知您，您有责任在规定时间内进行说明并出具证明材料，如您未能提供证据或您逾期未能反馈的，康达医药公司将采取包括但不限
                    于立即终止服务、
                    中止服务或删除相应信息等处理措施。因您未及时更新联系方式或联系方式不正确而致使未能联系到您的，亦视为您逾期未能反馈。</p>
            </div>
            <div>
                六、保密责任<br/>
                <p>
                    1、保密资料指由一方向另一方披露的所有技术及非技术信息(包括但不限于产品资料，产品计划，价格，财务及营销规划，业务战略，用户信息，用户数据，
                    研发，软件硬件，API应用数据接口，技术说明，设计，特殊公式，特殊算法等)。</p>
                2、本服务条款双方同意对获悉的对方保密资料信息予以保密，并严格限制接触上述保密信息的员工遵守本条之保密义务。本服务条款双方同意尽最大
                的努力保护保密信息等不被披露。除非国家机关依法强制要求或上述保密资料已经进入公有领域外，接受保密资料的一方不得对外披露。 一旦发现有
                保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。
                3、本保密责任条款不因本服务条款的终止而失效。
            </div>
            <div>
                七、违约责任<br/>
                <p>
                    1、 本服务条款任何一方违约均须依法承担违约责任。</p>
                <p>
                    2、 您理解并同意，鉴于计算机、互联网的特殊性，下述情况不属于康达医药公司违约：</p>
                <p>
                    （1）康达医药公司在进行康达医药服务配置、维护、升级时，需要短时间中断服务；</p>
                <p>
                    （2）鉴于互联网的特殊性，康达医药公司提供的服务涉及到互联网及相关信息等服务，可能会受到Internet不稳定因素的影响。
                    因此服务存在因上述不可抗力、计算机病毒或黑客攻击、系统不稳定、您所在位置、您关机、通信网络
                    、Internet等原因等造成您访问康达医药服务速度下降或无法使用；由此给您或者第三方造成的损失不应由康达医药公司承担。</p>
                <p>
                    3、由于您的故意或过失导致遭受损失的，康达医药公司不承担任何责任。</p>
                <p>
                    4、如因康达医药公司原因，造成您的重大损失，您可以终止服务，但非康达医药公司控制之内的不可抗力原因引起的除外。</p>
                <p>
                    5、因不可抗力或者其他意外事件，使得本条款履行不可能、不必要或者无意义的，遭受不可抗力、意外事件的一方不承担责任。（不可抗力、
                    意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震
                    、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。）</p>
                <p>
                    6、如果康达医药公司违反服务条款规定的义务，给您造成损失的，赔偿金的最高限额为您向康达医药公司首次提出赔偿主张时最
                    近一次续费实际支付的“康达医药服务”服务费。您未续费的，以首次支付的“服务费”为限额。</p>
                    7、在任何情况下，康达医药公司对本服务条款所承担的违约赔偿责任总额不超过违约服务对应之服务费总额。
            </div>
            <div>
                八、争议解决及法律适用
                <p>
                    1、 因本服务条款引起的或与本服务条款有关的任何争议，双方应通过友好协商方式解决；若协商不成，可将争议提交中国国际经济贸易仲裁</p>
                <p>
                    委员会四川分会仲裁。如果协商或仲裁未成，双方同意向康达医药公司主要经营地的人民法院起诉。</p>
                <p>
                    2、本服务条款的效力、生效、解释、执行、管辖、争议的解决均适用中华人民共和国法律和计算机、互联网行业的规范。</p>
            </div>
            <div>
                九、服务期限与终止<p>
                1、如果你与康达医药公司已经签署《康达医药服务协议》，服务期限由您与康达医药公司已经签署《康达医药服务协议》中的服务期限条款约定；
                如果没有，自您获取康达医药的用户账号和密码之日起计算，并以您所缴纳的服务费款项数额为依据确认服务期限。</p>
                <p>
                    2、 发生下列情形，服务条款提前终止：</p>
                <p>
                    （1）双方协商一致提前终止的；</p>
                <p>
                    （2）您严重违反本服务条款（包括但不限于您未按照协议约定履行付款义务，或您严重违反法律规定等），康达医药公司有权提前终止服务，并不退还您
                    已经支付的费用；</p>
                <p>
                    （3）您理解并充分认可，虽然康达医药公司已经建立必要的技术措施并将根据技术的发展不断完善相关技术措施来防御包括计算机病毒、网络入侵和攻击破
                    坏（包括但不限于DDOS）等危害网络安全事项或行为，但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，
                    如您因此终止服务的，康达医药公司将按照实际提供服务月份计算（不足一个月的按一个月计）服务费，将剩余款项（如有）返还给您；</p>
            </div>
            <div>
                十、特别声明<p>
                1、康达医药公司郑重提示：为享有高效优质的服务，请您务必仔细阅读并确保完全理解服务条款是最新版本。您完全理解并认可明白，康达医药公司网站
                及App有康达医药服务的最新版本，任何人士和机构提供的文件中有关康达医药服务描述与本服务条款矛盾的，以本服务条款为准。<br/>
                2、康达医药公司有权在必要时修改服务条款，服务条款一旦发生变动，将会在康达医药公司网站及App的重要页面上提示修改内容。如果您不同意所改
                动的内容，您可以主动取消服务。如果您继续享用康达医药公司服务，则视为接受服务条款的变动。康达医药公司保留随时修改其服务体系和价格而不需
                通知您的权利，康达医药公司修改其服务和价格体系之前您就具体服务与康达医药公司达成协议并已按照约定交纳费用的，康达医药公司将按照已达成的
                协议执行至已交纳费用的服务期期满。</p>
                <p>
                    3、因康达医药公司上市、被收购、与第三方合并、名称变更等事由，康达医药公司有权将本服务条款的权利义务全部或者部分转移给相应的康达医药公司
                    权利及义务的承受者。</p>
                <p>
                    4、如果任何条款在性质上或其他方面理应地在此服务条款终止时继续存在，那么应视为继续存在的条款，这些条款包括但不局限于保证条款、保密条款、
                    知识产权条款、法律适用及争议解决条款。</p>
                <p>
                    5、本服务条款中有关条款若被权威机构认定为无效，不应影响其他条款的效力，也不影响本服务条款的解释、违约责任及争议解决的有关约定的效力。<br/>
                    6、在接受本服务条款之前，请您仔细阅读本服务条款的全部内容。如果您对本服务条款的条款有疑问的，请您联系康达医药公司，康达医药公司将向您解释
                    条款内容。如果您不同意本服务条款的任意内容，或者无法准确理解康达医药公司对条款的解释，请不要进行后续操作。</p>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        name: "Serve"
    }
</script>

<style lang="scss" scoped>
    .edit {
        font-size: .28rem;
        padding: .5rem;
        letter-spacing: 1px;
        line-height: 1.5;
        margin-bottom: .6rem;
        text-align: left;

        p {
            text-indent: 2em;
        }
    }

    .p1 {
        font-size: .48rem;
        font-weight: bold;
        padding-left: .3rem;
        padding-top: .5rem;
    }
</style>